//-----------------------------------------------------------------------------
//!\file login_server.h
//!\author Aslan
//!
//!\date 2008-11-30
//! last 2008-11-30
//!
//!\brief LoginServer程序入口
//!
//!	Copyright (c) 2004 TENGWU Entertainment All rights reserved.
//-----------------------------------------------------------------------------
#pragma once

#include "Mutex.h"

//-----------------------------------------------------------------------------
// LoginServer程序入口
//-----------------------------------------------------------------------------
class LoginServer
{
public:
	//-------------------------------------------------------------------------
	// CONSTRUCT
	//-------------------------------------------------------------------------
	LoginServer();
	~LoginServer();

	//-------------------------------------------------------------------------
	// 初始化，主循环和销毁
	//-------------------------------------------------------------------------
	BOOL			Init(HINSTANCE hInst);
	VOID			Mainloop();
	VOID			Destroy();

	//-------------------------------------------------------------------------
	// 线程函数
	//-------------------------------------------------------------------------
	VOID			ThreadUpdate();

	//-------------------------------------------------------------------------
	// 锁函数
	//-------------------------------------------------------------------------
	VOID			LockUpdate()		{ m_UpdateMutex.Acquire(); }
	VOID			UnlockUpdate()		{ m_UpdateMutex.Release(); }

	//-------------------------------------------------------------------------
	// 关闭服务器
	//-------------------------------------------------------------------------
	VOID			Shutdown()			{ InterlockedExchange((long*)(&m_bTerminateUpdate), TRUE); }

	//-------------------------------------------------------------------------
	// 得到ID
	//-------------------------------------------------------------------------
	DWORD			GetSectionID()		{ return m_dwID; }

	//-------------------------------------------------------------------------
	// 辅助函数
	//-------------------------------------------------------------------------
	TObjRef<Log>&	GetLog()	{ return m_pLog; }
	TObjRef<Util>&	GetUtil()	{ return m_pUtil; }
	BOOL			IsSimFatigueServer()	{	return m_bSimFatigueServer;		}
	BOOL			IsEnableFatigueGuard()	{	return m_bEnableFatigueGuard;	}
	
private:
	//-------------------------------------------------------------------------
	// 辅助函数
	//-------------------------------------------------------------------------
	VOID			UpdateMemoryUsage();

private:
	TSFPTrunk<LoginServer>	m_Trunk;
	TObjRef<GDIRender>		m_pRender;
	TObjRef<WindowWrap>		m_pWindow;
	TObjRef<GUISystem>		m_pGUI;
	IGUIRenderNative*		m_pGUIRender;
	TObjRef<Thread>			m_pThread;
	TObjRef<Console>		m_pConsole;
	TObjRef<Log>			m_pLog;
	TObjRef<Util>			m_pUtil;

	//--------------------------------------------------------------------------
	// 大区ID
	//--------------------------------------------------------------------------
	DWORD					m_dwID;

	//--------------------------------------------------------------------------
	// 线程相关
	//--------------------------------------------------------------------------
	VOLATILE BOOL			m_bTerminateUpdate;		// 线程停止标志
	Mutex					m_UpdateMutex;			// 更新锁
	
	//--------------------------------------------------------------------------
	// 系统信息
	//--------------------------------------------------------------------------
	INT						m_nCpuNum;				// CPU 数量
	DWORD					m_dwTotalPhys;			// 总共物理内存
	DWORD					m_dwAvailPhys;			// 可用物理内存
	DWORD					m_dwTotalRunMinute;		// 服务器运行的时间

	BOOL					m_bSimFatigueServer;	// 模拟防沉迷服务器
	BOOL					m_bEnableFatigueGuard;	// 开启防沉迷

	//--------------------------------------------------------------------------
	// 统计信息
	//--------------------------------------------------------------------------
	volatile DWORD			m_dwIdleTime;			// 空闲时间
	volatile DWORD			m_dwTick;				// 服务器心跳
};

extern LoginServer g_login;

#define ILOG	(g_login.GetLog())
#define IUTIL	(g_login.GetUtil())


