//-----------------------------------------------------------------------------
//!\file	server.h
//!\brief	运营服务器
//!
//!\date	2009-04-20
//! last	2009-04-20
//!\author	zhangrong
//!
//! Copyright (c) 1985-2008 CTCRST Entertainment All rights reserved.
//-----------------------------------------------------------------------------
#pragma once

//-----------------------------------------------------------------------------
// 运营服务管理器
//-----------------------------------------------------------------------------
class Server
{
public:
	//-------------------------------------------------------------------------
	// Construct
	//-------------------------------------------------------------------------
	Server();
	~Server(){}

	//-------------------------------------------------------------------------
	// 初始化，更新，及销毁
	//-------------------------------------------------------------------------
	BOOL	Init();
	VOID	MainLoop();
	VOID	Destroy();

	//-------------------------------------------------------------------------
	// 各种Get
	//-------------------------------------------------------------------------
	BOOL	IsServerShutDown()				{ return m_bTerminateUpdate; }

	//-------------------------------------------------------------------------
	// 锁相关
	//-------------------------------------------------------------------------
	VOID	Lock()							{ m_Mutex.Acquire(); }
	VOID	UnLock()						{ m_Mutex.Release(); }

	//-------------------------------------------------------------------------
	// 辅助函数
	//-------------------------------------------------------------------------
	TObjRef<Util>&		GetUtil()			{ return m_pUtil; }
	TObjRef<Log>&		GetLog()			{ return m_pLog; }

private:
	TSFPTrunk<Server>				m_Trunk;
	TObjRef<VarContainer>			m_pVar;
	TObjRef<Log>					m_pLog;
	TObjRef<Util>					m_pUtil;

	volatile BOOL					m_bTerminateUpdate;		// 是否停止主循环
	Mutex							m_Mutex;				// 主循环锁
};

extern Server g_Server;

#define	IUTIL		(g_Server.GetUtil())
#define ILOG		(g_Server.GetLog())

