//-----------------------------------------------------------------------------
// File: new_protect
// Auth: Lyp
// Date: 2004-2-26	
// Last: 2004-2-26
//-----------------------------------------------------------------------------
#include "..\stdafx.h"
#include "new_protect.h"

namespace vEngine {
//-----------------------------------------------------------------------------
// 对new的结果进行检测,如果发现失败,则提示用户选择是否 退出/重试/继续
//-----------------------------------------------------------------------------
INT NewHandle( size_t size )
{
	// 提示用户,让用户处理
	TObjRef<Debug>()->ErrMsg(_T("MALLOC(or NEW) for %lu bytes failed\r\n"), size);
	return 1;
}

}