//-----------------------------------------------------------------------------
//!\file msg_activity.h
//!
//!\date 2009-03-29
//!
//!\brief 客户端与服务器之间关于活动的消息
//-----------------------------------------------------------------------------

#pragma once
#pragma pack(push, 1)

//-----------------------------------------------------------------------------
// 脚本的缺省消息（NC_DefaultRequest)事件类型定义（该类型定义在lua中使用）
//-----------------------------------------------------------------------------
/*
dwEventType = 1				// 客户端请求PVP固定活动界面 
dwEventType = 2				// 查询玩家在固定活动中的排名
*/

CMD_START(NS_ActivityTaskState)				// 广播活动当前状态给服务器内所有玩家
	INT		nState;							// 0-即将开始 1-开始 2-即将结束 3-结束 
	TCHAR	szName[X_SHORT_NAME];			// 活动名称
	BYTE	byHour;
	BYTE	byMinute;
CMD_END

CMD_START(NS_RoleInitOk)				// 玩家初始化结束
CMD_END


#pragma pack(pop)