//-----------------------------------------------------------------------------
// Copyright (c) 2004 TENGWU Entertainment All rights reserved.
// filename: msg_gm_cmd.h
// author: 
// actor:
// data: 
// last:
// brief: GM命令相关消息
//-----------------------------------------------------------------------------
#pragma once

#include "msg_common_errorcode.h"

#pragma pack(push, 1)
//----------------------------------------------------------------------------
// 错误码枚举
//----------------------------------------------------------------------------
enum
{
	E_GMCmd_Low_Privilege,	// 权限不够

};



#define MAX_GM_COMMAND_LEN 128 
//----------------------------------------------------------------------------
// 消息结构
//----------------------------------------------------------------------------
CMD_START(NC_GMCommand)		// 通用GM命令
	TCHAR	szCommand[MAX_GM_COMMAND_LEN];
CMD_END;

//----------------------------------------------------------------------------
// 游戏世界发给客户端，控制某个任务为已完成，或者未完成
//----------------------------------------------------------------------------
CMD_START(NS_GMQuestState)		// 通用GM命令
	UINT16		u16QuestID;		// 任务ID
	BOOL		bDone;			// 任务状态 TRUE：已完成，FALSE：未完成
CMD_END;

//----------------------------------------------------------------------------
#pragma pack(pop)