//-----------------------------------------------------------------------------
//!\brief 金牌网吧相关消息
//-----------------------------------------------------------------------------
#pragma once
#pragma pack(push,1)

//-----------------------------------------------------------------------------
// 获取金牌网吧名称
//-----------------------------------------------------------------------------
CMD_START(NC_GetVipNetBarName)
	INT			nNum;				// 请救ID的个数
	DWORD		dwAllID[1];			// 变长数组,存放dwNum个id
CMD_END

struct tagNetBarIDName
{
	DWORD		dwRoleID;
	TCHAR		szNetBarName[X_SHORT_NAME];
};
CMD_START(NS_GetVipNetBarName)
	INT					nNum;		// 返回ID的个数
	tagNetBarIDName		name[1];	// 返回金牌网吧名称
CMD_END

//-----------------------------------------------------------------------------
// 金牌网吧礼物送出(客户端会弹出提示对话框)
//-----------------------------------------------------------------------------
CMD_START(NS_VipNetBarGift)
CMD_END

#pragma pack(pop)