//-----------------------------------------------------------------------------
//!\file msg_city_struggle.h
//!
//!\date 2009-09-24
//!\author	twan
//!\brief 客户端与服务器之间关于城战的消息
//-----------------------------------------------------------------------------

#pragma once
#pragma pack(push, 1)

#include "msg_common_errorcode.h"
#include "city_define.h"

//----------------------------------------------------------------------------
// 玩家进入城战场景
//----------------------------------------------------------------------------
CMD_START(NS_RoleEnterCityStruggle)
	INT32	nNum;						// 敌对阵营帮派数量
	DWORD	dwEnemyGuildID[1];			// 敌对阵营帮派ID
CMD_END

//----------------------------------------------------------------------------
// 玩家离开城战场景
//----------------------------------------------------------------------------
CMD_START(NS_RoleLeaveCityStruggle)

CMD_END

//----------------------------------------------------------------------------
// 等待召唤
//----------------------------------------------------------------------------
CMD_START(NC_WaitSummon)
	DWORD	dwCreatureID;			// 守护石ID
CMD_END

CMD_START(NS_WaitSummon)
	INT		nPersonNum;				// 当前召唤人数
	INT		nNeedPersonNum;			// 需要召唤人数
	BOOL	bSuccess;				// 是否成功激活守护石
CMD_END

//----------------------------------------------------------------------------
// 取消召唤
//----------------------------------------------------------------------------
CMD_START(NC_CancelSummon)
	DWORD	dwCreatureID;			// 守护石ID
CMD_END

//----------------------------------------------------------------------------
// 开始召唤
//----------------------------------------------------------------------------
CMD_START(NS_BeginSummon)
	INT		nCountDown;				// 召唤时间
CMD_END

#pragma pack(pop)