//-----------------------------------------------------------------------------
// Copyright (c) 2004 TENGWU Entertainment All rights reserved.
// filename: login_issue.h
// author: 
// actor:
// data: 2008-06-04
// last:
// brief: 登陆服务器与区域服务器相关消息
//-----------------------------------------------------------------------------
#pragma once

#include "..\WorldDefine\msg_common_errorcode.h"
#include "login_define.h"

#pragma pack(push, 1)

enum
{
	E_PlayerWillLogin_PlayerNumLimit	=	1,	// 超出人数限制

	E_PlayerLogin_VerifyCodeError		=	11,	// 验证码错误
	E_PlayerLogin_TimeOut				=	12,	// 超时
};

//------------------------------------------------------------------------------
// 区域服务器与登陆服务器认证消息
//------------------------------------------------------------------------------
CMD_START(NLW_Certification)
	DWORD			dwGoldenCode;
CMD_END

CMD_START(NWL_Certification)
	DWORD			dwGoldenCode;
	TCHAR			szWorldName[X_SHORT_NAME];
	DWORD			dwPort;	//ZoneServer端口
	DWORD			dwIP;	//服务器IP,用于广域网
	INT				nOLAccountNum;
	DWORD			dwOLAccountID[1];// 所有当前在线玩家
CMD_END

//-------------------------------------------------------------------------------
// 心跳
//-------------------------------------------------------------------------------
CMD_START(NLW_HeartBeat)
CMD_END

//-------------------------------------------------------------------------------
// 区域服务器通知登陆服务器当前服务器状态
//-------------------------------------------------------------------------------
CMD_START(NWL_WorldStatus)
	EWorldStatus	eStatus;			// 当前服务器状态
	INT				nPlayerNumLimit;	// 当前服务器的人数限制
	INT				nCurPlayerNum;		// 当前人数（包括真正在线的和等待进入的）
	INT				nCurPlayerDisplay;		// 当前人数（包括真正在线的和等待进入的）
CMD_END

//--------------------------------------------------------------------------------
// 登陆服务器通知区域服务器帐号登入
//--------------------------------------------------------------------------------
CMD_START(NLW_PlayerWillLogin)
	DWORD			dwAccountID;
	BYTE			byPrivilege;	//权限
	DWORD			dwVerifyCode;
	BOOL			bGuard;			// 防沉迷
	DWORD			dwAccOLSec;		// 累计登录时间
	char			szAccount[X_SHORT_NAME];	// 玩家账号

	tagDWORDTime	dwPreLoginTime;				//上次登录时间
	DWORD			dwPreLoginIP;				//上次登录ip
CMD_END

//--------------------------------------------------------------------------------
// 区域服务器通知登陆服务器帐号可以登入
//--------------------------------------------------------------------------------
CMD_START(NWL_PlayerWillLogin)
	DWORD			dwErrorCode;
	DWORD			dwAccountID;
CMD_END


//--------------------------------------------------------------------------------
// 区域服务器通知登陆服务器玩家登入
//--------------------------------------------------------------------------------
CMD_START(NWL_PlayerLogin)
	DWORD			dwAccountID;
	DWORD			dwIP;
	DWORD			dwErrorCode;
CMD_END

//---------------------------------------------------------------------------------
// 区域服务器通知登陆服务器玩家登出
//---------------------------------------------------------------------------------
CMD_START(NWL_PlayerLogout)
	DWORD			dwAccountID;
CMD_END

//---------------------------------------------------------------------------------
// 登陆服务器通知区域服务器踢出指定玩家(已经在区域服务器中的玩家再次登录时, 就要踢被区域服务器掉)
//---------------------------------------------------------------------------------
CMD_START(NLW_KickPlayer)
	DWORD			dwAccountID;
CMD_END

//---------------------------------------------------------------------------------
// 区域服务器提出玩家时，通知给登陆服务器做记录
//---------------------------------------------------------------------------------
CMD_START(NWL_KickLog)
	DWORD			dwAccountID;	// 账号
	DWORD			dwKickTime;		// 踢出时间
	DWORD			u16ErrCode;		// 反外挂系统提供的错误号
	BYTE			bySeal;			// 是否封号
CMD_END


//---------------------------------------------------------------------------------
// 区域服务器被关闭时，登陆服务器返回
//---------------------------------------------------------------------------------
CMD_START(NLW_WorldColsed)

CMD_END
//---------------------------------------------------------------------------------
// 区域服务器被关闭时，通知给登陆服务器改变玩家登陆状态
//---------------------------------------------------------------------------------
CMD_START(NWL_WorldColsed)

CMD_END

//---------------------------------------------------------------------------------
// 封号
//---------------------------------------------------------------------------------
CMD_START(NWL_ForbidAccount)
	DWORD			dwAccountID;	// 帐号
	DWORD			dwForbidCode;	// 封号码
CMD_END




#pragma pack(pop)