//-------------------------------------------------------------------------------
// Copyright (c) 2004 TENGWU Entertainment All rights reserved.
// filename: quest.h
// actor:
// data: 2008-9-1
// last:
// brief: 任务类
//-------------------------------------------------------------------------------
#pragma once
#include "..\WorldDefine\script_data.h"

struct tagQuestProto;
class Role;
class QuestScript;

class Quest:public ScriptData<ESD_Quest>
{
public:
	//----------------------------------------------------------------------------
	// Constructor&Destructor
	//----------------------------------------------------------------------------
	Quest();
	~Quest();

	//----------------------------------------------------------------------------
	// 初始化
	//----------------------------------------------------------------------------
	VOID Init(const tagQuestProto* pQuest, Role* pRole, INT nIndex);
	VOID Init(const tagQuestSave* pQuestSave, Role* pRole, INT nIndex);

	//----------------------------------------------------------------------------
	// 事件
	//----------------------------------------------------------------------------
	VOID OnAccept(Creature* pNPC);
	VOID OnComplete(Creature* pNPC);
	VOID OnCancel();

	//----------------------------------------------------------------------------
	// 销毁
	//----------------------------------------------------------------------------
	VOID Destroy();

	//----------------------------------------------------------------------------
	// 保存
	//----------------------------------------------------------------------------
	VOID InitQuestSave(OUT tagQuestSave* pQuestSave);

	//----------------------------------------------------------------------------
	// 生成消息结构
	//----------------------------------------------------------------------------
	VOID GenerateMsgInfo(tagIncompleteQuestMsgInfo* pInfo, DWORD &dwMsgSize, DWORD &dwQuestSize);

	//----------------------------------------------------------------------------
	// 得到任务初始物品
	//----------------------------------------------------------------------------
	VOID GetInitQuestItem(INT16* const n16ItemCount);

	//----------------------------------------------------------------------------
	// 得到任务动态目标
	//----------------------------------------------------------------------------
	VOID GetInitDynamicTarget(tagQuestDynamicTarget* pInfo, DWORD &dwSize);

	//----------------------------------------------------------------------------
	// 各种Get
	//----------------------------------------------------------------------------
	const tagQuestProto*	GetProto()			{ return m_pProto; }
	UINT16					GetID()				{ return P_VALID(m_pProto) ? m_pProto->id : GT_INVALID; }
	DWORD					GetAcceptTime()		{ return m_dwStartTime; }
	INT						GetIndex()			{ return m_nIndex; }
	tagQuestDynamicTarget*	GetDynamicTarget()	{ return m_pDynamicTarget; }

	BOOL					IsValid()			{ return P_VALID(m_pProto); }

	//----------------------------------------------------------------------------
	// 检测任务物品是否已经满了
	//----------------------------------------------------------------------------
	BOOL					IsQuestItemFull(DWORD dwItemTypeID);

	//----------------------------------------------------------------------------
	// 各种Set
	//----------------------------------------------------------------------------
	VOID					SetProto(const tagQuestProto* pQuestProto) { m_pProto = pQuestProto; }
	VOID					SetOwner(Role* pRole) { m_pOwner = pRole; }
	VOID					SetCompleteMark(BOOL bComplete) { m_bComplete = bComplete; }

	//----------------------------------------------------------------------------
	// 是否可以完成
	//----------------------------------------------------------------------------
	BOOL IsCanComplete(INT nChoiceItemIndex, Creature* pNPC=NULL);

	//----------------------------------------------------------------------------
	// 触发事件
	//----------------------------------------------------------------------------
	VOID OnEvent(EQuestEvent eQuestType, DWORD dwEventMisc1=0, DWORD dwEventMisc2=0, DWORD dwEventMisc3=0);

	//----------------------------------------------------------------------------
	// 杀怪事件
	//----------------------------------------------------------------------------
	VOID OnEventCreatureKill(DWORD dwCreatureTypeID, INT nCreatureLevel);

	//----------------------------------------------------------------------------
	// 物品事件
	//----------------------------------------------------------------------------
	VOID OnEventItem(DWORD dwItemTypeID, INT nNum, BOOL bAdd);

	//----------------------------------------------------------------------------
	// NPC对话事件
	//----------------------------------------------------------------------------
	VOID OnEventNPCTalk(DWORD dwNPCID, DWORD dwNPCTypeID);

	//----------------------------------------------------------------------------
	// 触发器事件
	//----------------------------------------------------------------------------
	VOID OnEventTrigger(DWORD dwTriggerSerial);

	//----------------------------------------------------------------------------
	// 调查地物事件
	//----------------------------------------------------------------------------
	VOID OnEventInvest(DWORD dwNPCID, DWORD dwNPCTypeID);

	//----------------------------------------------------------------------------
	// 服务器可控对话框缺省事件
	//----------------------------------------------------------------------------
	VOID OnEventDlgDefault(DWORD dwDlgOption);

private:
	//----------------------------------------------------------------------------
	// 搜集初始物品
	//----------------------------------------------------------------------------
	VOID InitQuestItem();

	//----------------------------------------------------------------------------
	// 杀怪是否满足
	//----------------------------------------------------------------------------
	BOOL IsCanCompleteCreatureKill(BOOL bOnlyOne=FALSE);

	//----------------------------------------------------------------------------
	// 物品是否满足
	//----------------------------------------------------------------------------
	BOOL IsCanCompleteItem(BOOL bOnlyOne=FALSE);

	//----------------------------------------------------------------------------
	// NPC是否满足
	//----------------------------------------------------------------------------
	BOOL IsCanCompleteNPCTalk(BOOL bOnlyOne=FALSE);

	//----------------------------------------------------------------------------
	// 触发器是否满足
	//----------------------------------------------------------------------------
	BOOL IsCanCompleteTrigger(BOOL bOnlyOne=FALSE);

	//----------------------------------------------------------------------------
	// 调查地物是否满足
	//----------------------------------------------------------------------------
	BOOL IsCanCompleteInvest(BOOL bOnlyOne=FALSE);

	//----------------------------------------------------------------------------
	// 金钱
	//----------------------------------------------------------------------------
	BOOL IsCanCompleteMoney(BOOL bOnlyOne=FALSE);

	//----------------------------------------------------------------------------
	// 等级
	//----------------------------------------------------------------------------
	BOOL IsCanCompleteLevel(BOOL bOnlyOne=FALSE);

	//----------------------------------------------------------------------------
	// 地图
	//----------------------------------------------------------------------------
	BOOL IsCanCompleteMap(BOOL bOnlyOne=FALSE);

	//----------------------------------------------------------------------------
	// 奖励
	//----------------------------------------------------------------------------
	BOOL IsCanCompleteReward(INT nChoiceItemIndex);

private:
	const tagQuestProto*	m_pProto;									// 静态属性
	Role*					m_pOwner;									// 所属玩家
	INT						m_nIndex;									// 所处的任务列表索引
	BOOL					m_bComplete;								// 是否通过可完成判断
	INT16					m_n16CreatureCount[QUEST_CREATURES_COUNT];	// 玩家已经杀了怪物的数量
	INT16					m_n16ItemCount[QUEST_ITEMS_COUNT];			// 玩家已经收集了物品的数量
	bool					m_bSpeakNPC[QUEST_NPC_COUNT];				// 玩家已经对话过的NPCID
	bool					m_bTrigger[QUEST_TRIGGERS_COUNT];			// 玩家已经踩的触发器
	bool					m_bInvest[DYNAMIC_TARGET_COUNT];			// 玩家调查过的地物
	tagQuestDynamicTarget*	m_pDynamicTarget;							// 任务动态目标

	DWORD					m_dwStartTime;								// 任务接取时间

	const QuestScript*		m_pScript;									// 任务脚本
};