//-----------------------------------------------------------------------------
//!\file world.h
//!\author Aslan
//!
//!\date 2009-06-09
//! last 2009-06-09
//!
//!\brief 游戏世界
//!
//!	Copyright (c) 2004 TENGWU Entertainment All rights reserved.
//-----------------------------------------------------------------------------
#pragma once

class BillEvent;
class BillEventMgr;
class WorldDB;

#include "world_db.h"

//-----------------------------------------------------------------------------
// 游戏世界
//-----------------------------------------------------------------------------
class World
{
public:
	//-------------------------------------------------------------------------
	// CONSTRUCT
	//-------------------------------------------------------------------------
	World();
	~World();

	//-------------------------------------------------------------------------
	// 初始化和销毁
	//-------------------------------------------------------------------------
	BOOL	Init(INT nIndex);
	VOID	Destroy();

	//-------------------------------------------------------------------------
	// LoongWorld连接相关
	//-------------------------------------------------------------------------
	VOID	LoongWorldLogin()		{ InterlockedExchange((LPLONG)&m_bValid, TRUE); }
	VOID	LoongWorldLogout()		{ InterlockedExchange((LPLONG)&m_bValid, FALSE); }

	//-------------------------------------------------------------------------
	// 各种Get
	//-------------------------------------------------------------------------
	DWORD	GetID()			{ return m_dwID; }
	BOOL	IsValid()		{ return m_bValid; }
	BOOL	IsDBLost()		{ return m_DB.IsConLost(); }

	//-------------------------------------------------------------------------
	// 统计信息
	//-------------------------------------------------------------------------
	INT		GetBillYuanbaoSuccessTimes()		{ return m_nBillYuanbaoSuccessTimes; }
	INT		GetBillItemSuccessTimes()			{ return m_nBillItemSuccessTimes; }

	VOID	CountBillYuanbaoSuccessTimes()		{ InterlockedExchangeAdd((LPLONG)&m_nBillYuanbaoSuccessTimes, 1); }
	VOID	CountBillItemSuccessTimes()			{ InterlockedExchangeAdd((LPLONG)&m_nBillItemSuccessTimes, 1); }

private:
	//-------------------------------------------------------------------------
	// 更新线程
	//-------------------------------------------------------------------------
	VOID	ThreadUpdate();

	//-------------------------------------------------------------------------
	// 处理消息
	//-------------------------------------------------------------------------
	VOID	UpdateSession();

private:
	TSFPTrunk<World>			m_Trunk;
	TObjRef<Thread>				m_pThread;

	//-------------------------------------------------------------------------
	// 基本信息
	//-------------------------------------------------------------------------
	DWORD						m_dwID;				// world id
	volatile BOOL				m_bValid;			// 当前loongworld服务器是否连接

	//-------------------------------------------------------------------------
	// 线程相关
	//-------------------------------------------------------------------------
	volatile BOOL				m_bTerminate;		// 是否要结束线程
	tstring						m_strThreadName;	// 线程名称
	
	//-------------------------------------------------------------------------
	// 数据库及消息列表
	//-------------------------------------------------------------------------
	WorldDB						m_DB;				// 游戏世界数据库

	//-------------------------------------------------------------------------
	// 统计信息
	//-------------------------------------------------------------------------
	volatile INT				m_nBillYuanbaoSuccessTimes;	// 划拨元宝成功多少次
	volatile INT				m_nBillItemSuccessTimes;	// 划拨物品成功多少次
};